; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_2 ?v5 - type_2 ?v3 - type_1)
 	      (pred_4 ?v7 - object ?v3 - type_1)
	      (pred_3 ?v5 - type_2 ?v8 - type_3)
	      (pred_1 ?v5 - type_2 ?v7 - object ?v8 - type_3))

   (:action op_3
       :parameters  (?v5 - type_2 ?v6 ?v2 - type_1)
       :precondition (and  (pred_2 ?v5 ?v6))
       :effect (and  (pred_2 ?v5 ?v2)
		     (not (pred_2 ?v5 ?v6))))

   (:action op_1
       :parameters (?v5 - type_2 ?v1 - object ?v4 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_4 ?v1 ?v4) (pred_2 ?v5 ?v4) (pred_3 ?v5 ?v8))
       :effect (and (pred_1 ?v5 ?v1 ?v8)
		    (not (pred_4 ?v1 ?v4)) 
		    (not (pred_3 ?v5 ?v8))))

   (:action op_2
       :parameters (?v5 - type_2 ?v1 - object ?v4 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_1 ?v5 ?v1 ?v8) (pred_2 ?v5 ?v4))
       :effect (and (pred_4 ?v1 ?v4)
		    (pred_3 ?v5 ?v8)
		    (not (pred_1 ?v5 ?v1 ?v8)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_08 obj_13 - type_2
obj_05 obj_04 obj_07 obj_01 - type_3
obj_06 obj_03 obj_11 obj_09 - type_1
obj_10 obj_02 obj_12 obj_14 - object)
(:init
(pred_2 obj_08 obj_11)
(pred_3 obj_08 obj_05)
(pred_3 obj_08 obj_04)
(pred_2 obj_13 obj_11)
(pred_3 obj_13 obj_07)
(pred_3 obj_13 obj_01)
(pred_4 obj_10 obj_03)
(pred_4 obj_02 obj_11)
(pred_4 obj_12 obj_09)
(pred_4 obj_14 obj_11)
)
(:goal
(and
(pred_4 obj_10 obj_11)
(pred_4 obj_02 obj_11)
(pred_4 obj_12 obj_09)
(pred_4 obj_14 obj_09)
)
)

(:constraints
  (always (not (pred_2 obj_08 obj_09)))
)
)

; plan
1. (op_1 obj_13 obj_14 obj_11 obj_01)
   deleted: (pred_4 obj_14 obj_11) (pred_3 obj_13 obj_01)
   added: (pred_1 obj_13 obj_14 obj_01)
   goals met: 2 of 4
2. (op_3 obj_08 obj_11 obj_03)
   deleted: (pred_2 obj_08 obj_11)
   added: (pred_2 obj_08 obj_03)
   goals met: 2 of 4
3. (op_3 obj_13 obj_11 obj_09)
   deleted: (pred_2 obj_13 obj_11)
   added: (pred_2 obj_13 obj_09)
   goals met: 2 of 4
4. (op_1 obj_08 obj_10 obj_03 obj_04)
   deleted: (pred_4 obj_10 obj_03) (pred_3 obj_08 obj_04)
   added: (pred_1 obj_08 obj_10 obj_04)
   goals met: 2 of 4
5. (op_2 obj_13 obj_14 obj_09 obj_01)
   deleted: (pred_1 obj_13 obj_14 obj_01)
   added: (pred_4 obj_14 obj_09) (pred_3 obj_13 obj_01)
   goals met: 3 of 4
6. (op_3 obj_08 obj_03 obj_11)
   deleted: (pred_2 obj_08 obj_03)
   added: (pred_2 obj_08 obj_11)
   goals met: 3 of 4
7. (op_2 obj_08 obj_10 obj_11 obj_04)
   deleted: (pred_1 obj_08 obj_10 obj_04)
   added: (pred_4 obj_10 obj_11) (pred_3 obj_08 obj_04)
   goals met: 4 of 4
